/*
 * @Description:
 * @Author: Hongzf
 * @Date: 2022-12-07 14:16:56
 * @LastEditors: Hongzf
 * @LastEditTime: 2022-12-08 10:32:30
 */
//飞线数据
export const flyVal = [
  // [{终点信息}，{起点信息}]
  [{ name: '洛阳' }, { name: '洛阳', value: 100 }],
  // [{ name: '洛阳' }, { name: '西安', value: 35 }],
  // [{ name: '洛阳' }, { name: '兰州', value: 25 }],
  [{ name: '洛阳' }, { name: '乌鲁木齐', value: 55 }],
  // [{ name: '洛阳' }, { name: '包头', value: 60 }],
  // [{ name: '洛阳' }, { name: '西宁', value: 45 }],
  // [{ name: '洛阳' }, { name: '银川', value: 35 }],
  // [{ name: '洛阳' }, { name: '成都', value: 35 }],
  // [{ name: '洛阳' }, { name: '重庆', value: 40 }],
  // [{ name: '洛阳' }, { name: '拉萨', value: 45 }],
  [{ name: '洛阳' }, { name: '昆明', value: 50 }],
  [{ name: '洛阳' }, { name: '贵阳', value: 55 }],
  [{ name: '洛阳' }, { name: '太原', value: 60 }],
  [{ name: '洛阳' }, { name: '武汉', value: 65 }],
  [{ name: '洛阳' }, { name: '长沙', value: 70 }],
  [{ name: '洛阳' }, { name: '南昌', value: 75 }],
  [{ name: '洛阳' }, { name: '合肥', value: 80 }],
  // [{ name: '洛阳' }, { name: '杭州', value: 85 }],
  // [{ name: '洛阳' }, { name: '广州', value: 90 }],
  // [{ name: '洛阳' }, { name: '北京', value: 95 }],
  // [{ name: '洛阳' }, { name: '天津', value: 60 }]
]
//上面涉及城市的经纬度
export const flyGeo ={
  洛阳: [112.460299, 34.62677],
  西安: [108.946466, 34.347269],
  兰州: [103.84044, 36.067321],
  乌鲁木齐: [87.62444, 43.830763],
  包头: [109.846544, 40.662929],
  西宁: [101.78443, 36.623393],
  银川: [106.258602, 38.487834],
  成都: [104.081534, 30.655822],
  重庆: [106.558434, 29.568996],
  拉萨: [91.120789, 29.65005],
  昆明: [102.852448, 24.873998],
  贵阳: [106.636577, 26.653325],
  太原: [112.534919, 37.873219],
  武汉: [114.311582, 30.598467],
  长沙: [112.945473, 28.234889],
  南昌: [115.864589, 28.689455],
  合肥: [117.233443, 31.826578],
  杭州: [120.215503, 30.253087],
  广州: [113.271431, 23.135336],
  北京: [116.413384, 39.910925],
  天津: [117.209523, 39.093668]
}
